In [1]:
import pandas as pd
import numpy as np

In [2]:
# dataset_path = 'https://raw.githubusercontent.com/ProgressBG-Python-Course/JupyterNotebooksExamples/master/datasets/various/drinks.csv'
dataset_path='../datasets/drinks.csv'
df = pd.read_csv(dataset_path)
df.head(5)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

## Select rows/columns

In [ ]:
# select only 2 columns
df.loc[:,['wine_servings','continent']]

In [6]:
# swap column names:
# df[['country', 'beer_servings']] = df[['beer_servings','country']]
# df.head(5)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [ ]:
#select rows:  [5 - 10], and columns: wine_servings : continent
df.loc[5:10,'wine_servings':'continent']

In [ ]:
#select country and continent from odd row numbers
df.loc[1::2, ['country','continent']]

In [7]:
# select rows for which wine servings > 300
df[df.wine_servings > 300]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
3,Andorra,245,138,312,12.4,EU
61,France,127,151,370,11.8,EU
136,Portugal,194,67,339,11.0,EU

In [8]:
# select country names for which wine servings > 300
# df[df.wine_servings > 300]['country'] # bad
df.loc[df.wine_servings > 300, 'country'] # good

3       Andorra
61       France
136    Portugal
Name: country, dtype: object

In [16]:
# set country values as index
df.set_index('country', inplace=True)
df.head(5)

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,AS
Albania,89,132,54,4.9,EU
Algeria,25,0,14,0.7,AF
Andorra,245,138,312,12.4,EU
Angola,217,57,45,5.9,AF

In [17]:
# TASK: select rows for index values in given interval
df.loc['Bahamas':'Bulgaria']

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Bahamas,122,176,51,6.3,NaN
Bahrain,42,63,7,2.0,AS
Bangladesh,0,0,0,0.0,AS
Barbados,143,173,36,6.3,NaN
Belarus,142,373,42,14.4,EU
Belgium,295,84,212,10.5,EU
Belize,263,114,8,6.8,NaN
Benin,34,4,13,1.1,AF
Bhutan,23,0,0,0.4,AS
Bolivia,167,41,8,3.8,SA
Bosnia-Herzegovina,76,173,8,4.6,EU
Botswana,173,35,35,5.4,AF
Brazil,245,145,16,7.2,SA
Brunei,31,2,1,0.6,AS
Bulgaria,231,252,94,10.3,EU

In [19]:
# reset index
df.reset_index(drop=False,inplace=True)
df.head(5)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [ ]:
#select all rows and all columns, without 'country', 'continent'

# df.loc[:, 'beer_servings':'total_litres_of_pure_alcohol']
df.iloc[:, 1:-1]

In [ ]:
# select last 3 columns:
df.iloc[:, 1:-1]

## insert/drop columns

In [20]:
# Insert column  named 'random' with random integers in [1..10], in the beginnig (i.e. at index 0)

rand_ints = np.random.randint(1, high=11, size=df.shape[0])

df.insert(0, 'random', rand_ints)
df.head()
# np.random.randint?

,random,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,7,Afghanistan,0,0,0,0.0,AS
1,10,Albania,89,132,54,4.9,EU
2,5,Algeria,25,0,14,0.7,AF
3,5,Andorra,245,138,312,12.4,EU
4,1,Angola,217,57,45,5.9,AF

In [ ]:
# drop column 'random':
df.drop(columns='random', inplace=True)

In [23]:
df.head(3)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF

## Useful properties and methods

In [132]:
df.shape

(193, 6)

In [ ]:
df.index

In [ ]:
df.columns

In [ ]:
df.info()

In [24]:
df.describe()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
count,193.000000,193.000000,193.000000,193.000000
mean,106.160622,80.994819,49.450777,4.717098
std,101.143103,88.284312,79.697598,3.773298
min,0.000000,0.000000,0.000000,0.000000
25%,20.000000,4.000000,1.000000,1.300000
50%,76.000000,56.000000,8.000000,4.200000
75%,188.000000,128.000000,59.000000,7.200000
max,376.000000,438.000000,370.000000,14.400000

In [25]:
# select country names, which 'total_litres_of_pure_alcohol' == max
mask = df.total_litres_of_pure_alcohol == df.total_litres_of_pure_alcohol.max()

df.loc[mask, ['country','total_litres_of_pure_alcohol']]
# df.loc[mask]

    country  total_litres_of_pure_alcohol
15  Belarus                          14.4

In [30]:
# select country names, which 'beer_servings' > 75%
beer_df = df.loc[ df.beer_servings >df.beer_servings.quantile(0.75),:'beer_servings']
beer_df.head(3)

     country  beer_servings
3    Andorra            245
4     Angola            217
6  Argentina            193

In [32]:
beer_df.sort_values(by='beer_servings').head(10)

                country  beer_servings
44               Cyprus            192
6             Argentina            193
51   Dominican Republic            193
136            Portugal            194
143   St. Kitts & Nevis            194
155            Slovakia            196
174   Trinidad & Tobago            197
68              Grenada            199
121         New Zealand            203
180             Ukraine            206

In [34]:
# max by column values
# df.max(axis=0)

# max by rows values
df.max(axis=0)

/tmp/ipykernel_42594/3608777183.py:5: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.max(axis=0)

country                         Zimbabwe
beer_servings                        376
spirit_servings                      438
wine_servings                        370
total_litres_of_pure_alcohol        14.4
dtype: object

In [ ]:
df.head(5)

In [ ]:
# TASK: find the max value for Bulgaria
df.loc[df.country=='Bulgaria'].max(axis=1)

In [35]:
df.head(3)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF

In [38]:
df.groupby('continent').wine_servings.count()

continent
AF    53
AS    44
EU    45
OC    16
SA    12
Name: wine_servings, dtype: int64

In [ ]:
null_mask = df.continent.isnull().values
df.loc[null_mask]

In [ ]:
df.sort_values(by='wine_servings', axis=0)

##